Repository: loginom/loginom-l10n-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Входное поле не поддерживает новое назначение во внешнем разбиении (ограничение по типу данных)
en: The input field does not support the new usage type in the external partition (data type restriction)

source: Требуется непрерывный или дискретный вид данных
en: Continuous or discrete data kind is required

source: Минимальная доля класса
en: Minimum class rate

source: Для построения конечных классов необходимо активировать входной порт
en: Activation of input port is required to build the coarse classes

source: Получить столбец
en: Get column

source: Запрос не активен
en: Query is not active

source: Расчет статистики конечных классов
en: Calculating coarse classes statistics

source: Построение конечных классов
en: Building coarse classes

source: Кон. классы:
en: Coarse Classes:

source: Хранилище начальных классов одного из столбцов не определено
en: The fine classes storage of one of the columns not defined

source: Хранилище начальных классов не соответствует установленным настройкам
en: The fine classes storage does not comply with the customized settings

source: Размер внешнего разбиения для столбца "%s" превышают допустимое значение
en: The external binning size for "%s" column exceeds the allowable value

source: Внешнее разбиение для столбца "%s" отсутствует, либо порт не активирован
en: No external binning for "%s" column or port not activated

source: Внешнее разбиение для столбца "%s" содержит не все необходимые данные
en: External binning for "%s" column does not contain all required data

source: Внешнее разбиение для столбца "%s" не содержит уникальное значение "%s"
en: External binning for "%s" column does not contain unique "%s" value

source: Вставить столбец
en: Paste column

source: Внешнее разбиение содержит не все уникальные значения столбца "%s"
en: External binning contains not all unique values of "%s" column

source: Источник данных с внешним разбиением отсутствует
en: No external binning data source

source: Во входных данных более одного выходного поля
en: Input data has more than one output field

source: Тип данных столбца %s не поддерживается
en: Column data type %s not supported

source: Не удалось получить уникальные значения столбца "%s"
en: Failed to get unique values for "%s" column

source: Предыдущее разбиение отсутствует для столбца "%s"
en: No previous binning for "%s" column

source: Значимости столбцов
en: Column significance

source: Параметры классов
en: Class parameters

source: Проверить, установлено ли значение в ячейке таблицы
en: Check if the value is set in the table cell

source: Минимизация разнообразия входных значений
en: Minimize input values diversity

source: [пусто]
en: [blank]

source: Не удалось определить столбец для обработки
en: Failed to define the column to process

source: Невозможно сформировать начальные классы для поля "%s": все значения пропущенные
en: Failed to generate fine classes for "%s" field: all values are null

source: Заданный тип данных столбца не соответствует типу данных конечных классов
en: The specified column data type does not match the data type of the coarse classes

source: Установить значение в ячейку добавленной строки
en: Set value to the added row cell

source: В процессе построения начальных классов в поле "%s" отсутствует ранее присутствующее значение "%s"
en: No previously present "%s" value in "%s" field while building fine classes

source: В процессе построения начальных классов в поле "%s" обнаружено ранее отсутствовавшее значение
en: Previously missing value located in field "%s" while building fine classes

source: Класс пропусков
en: Null class

source: Типы данных
en: Data types

source: Метки
en: Captions

source: Количество строк результирующего набора превысило максимальное значение
en: Row count of the result dataset exceeded maximum value

source: Инф.: %s
en: Info: %s

source: Имена
en: Names

source: Трансп.: %s
en: Transp.: %s

source: Создание плоской таблицы из сводной
en: Create flat table from pivot table

source: Обрезать до мин. набора
en: Cut to min. set

source: Отсутствует источник данных для выравнивания
en: No data source for appending

source: Дополнять до присоед. табл. %d
en: Extend to joined table %d

source: Дополнять до присоед. перем. %d
en: Extend to joined var. %d

source: Дополнять до макс. набора
en: Extend to max. set

source: Дополнять до Главной
en: Extend to Main

source: Присоединяемые переменные
en: Joined variables

source: повторять набор данных
en: repeat dataset

source: повторять последнюю строку
en: repeat last row

source: Соединение нескольких наборов данных путем вертикальной склейки
en: Combine several datasets by vertical gluing

source: Ветвь
en: Branch

source: Для заданного набора данных не найден столбец агрегации количества строк
en: No row count aggregation column found for the specified dataset

source: Недопустимая операция: вызов метода GetLinkedFieldInfos
en: Invalid operation: GetLinkedFieldInfos method calling

source: Не задано ни одной ветви условия для выполнения в режиме отладки
en: No condition branches are specified for execution in the debug mode

source: Не указано поле для сравнения
en: No comparison field specified

source: Список условий содержит ошибки
en: The condition list contains errors

source: Функция агрегации "%s" не применима к заданному полю
en: "%s" aggregation function does not apply to the specified field

source: Значение "%s" не совместимо с типом данных "%s"
en: "%s" value is not compatible with "%s" data type

source: Тип отношения "%s" не применим для заданного поля и функции агрегации
en: "%s" relation type is not applicable to the specified field and aggregation function

source: Не задано ни одной ветви условия
en: No condition branches specified

source: Коллекция переменных
en: Collection of variables

source: Ветвь условия не может быть пустой
en: Condition branch cannot be empty

source: Условное выполнение ветки модели
en: Conditional execution of model branch

source: Поле1
en: Field 1

source: Поле2
en: Field 2

source: Корр. анализ: %s x %s
en: Correlation: %s x %s

source: Вычисление экстремумов взаимно корреляционных функций
en: Calculating extrema of cross-correlation functions

source: Вычисление коэффициентов корреляции
en: Calculating correlation coefficients

source: Вычисление коэффициентов корреляции Пирсона
en: Calculating Pearson correlation coefficients

source: Вычисление дополнительной статистики
en: Calculating ancillary statistics

source: Вычисление коэффициентов корреляции Спирмена
en: Calculating Spearman's correlation coefficients

source: Вычисление коэффициентов корреляции Тау-b Кендалла
en: Calculating Kendall's Tau-b correlation coefficients

source: Количество одновременно рассчитываемых корреляций не может быть больше %d
en: The number of calculated correlations cannot exceed %d

source: Количество обрабатываемых строк не может быть больше %d
en: The number of processed rows cannot be more than %d

source: Корреляционный анализ
en: Correlation Analysis

source: Расчет коэффициентов корреляции
en: Calculation of correlation coefficients

source: Построение кросс-таблицы
en: Building cross table

source: Выбрано слишком много измерений в колонках
en: Too many column dimensions selected

source: Не удалось сформировать имя колонки из уникального значения "%s"
en: Failed to generate column name from "%s" unique value

source: <Прочее>
en: <Other>

source: Ошибка выгрузки результатов запроса 1С
en: Error loading 1C query results

source: Создание сводной таблицы из плоской
en: Create pivot table from flat table

source: Заполнение пропусков
en: Imputing values

source: Заполнение пропущенных данных
en: Fill in missing data

source: Табл. в дерево:
en: Table to Tree:

source: Невозможно задать исходный столбец для узла-контейнера %s
en: Failed to set the source column for %s node-container

source: Невозможно задать столбец с индексом для узла %s, который не является массивом
en: Failed to set the column with index for %s node that is not an array

source: Не удалось найти столбец с индексом %s для узла %s
en: Column with %s index for %s node not found

source: Тип индекса узла %s не совместим с типом исходного столбца %s
en: Index type of %s node is not compatible with %s source column type

source: Недопустимое повторяющееся значение глобального индекса узла "%s": %d
en: Invalid repeated value of global index of "%s" node: %d

source: Не удалось найти исходный столбец %s для узла %s
en: Failed to find source %s column for %s node

source: Тип узла %s не совместим с типом исходного столбца %s
en: %s node type is not compatible with %s source column type

source: Таблица в дерево
en: Table to Tree

source: Формирование дерева данных из таблицы данных
en: Create data tree from data table

source: Превышена максимальная длина строки в %d символов
en: Maximum string length of %d characters exceeded

source: Расчет переменных
en: Calculating variables

source: Табл. в перем.:
en: Table to Var.:

source: Необходимо указать хотя бы один вариант агрегации для поля "%s"
en: At least one aggregation option for "%s" field must be specified

source: Расчет медианы
en: Calculating median

source: Агрегация данных в переменные
en: Aggregate data into variables

source: Формир. XML:
en: Generate XML:

source: Для выполнения операции необходимо сначала выбрать корневой элемент XML
en: To perform the operation it is required to select the root XML element first

source: Не определено поле, являющееся Идентификатором документа
en: No field that is the Document Identifier defined

source: Дерево XML не настроено
en: XML tree not configured

source: Узел %s, для которого запрошен подбор столбца входного набора, не входит в дерево XML
en: %s node for which input dataset column selection is requested is not included into XML tree

source: Индекс %d столбца выходной таблицы вне диапазона, число столбцов %d
en: Index %d of the output table column is out of range, column count %d

source: Не выбран корневой элемент XML
en: No root XML element selected

source: Узел %s, для которого запрошен сброс связи, не входит в дерево XML
en: %s node for which link reset is requested is not included into XML tree

source: Ошибка при выполнении формирования XML. Код ошибки: %d. Сообщение: %s
en: Error generating XML. Error code: %d. Message: %s

source: Обработка набора данных
en: Processing the dataset

source: Формирование XML-документа
en: Generating XML document

source: Столбец "%s" отсутствует в выходной таблице
en: No "%s" column in the output table

source: Формирование XML-документа в соответствии с заданной схемой XSD
en: XML document generation according to given XSD schema

source: Ошибка преобразования даты/времени в строку с форматом %s
en: Error converting date/time to string with %s format

source: Дата и время
en: Date and Time

source: Преобразования даты и времени
en: Reform date/time

source: Противоречие
en: Inconsistency

source: Группа противоречия
en: Inconsistency group

source: Индекс %d столбца входной таблицы №%d вне диапазона, число столбцов %d
en: Index %d of the input table column #%d is out of range, column count %d

source: Дубликат
en: Duplicate

source: Группа дубликата
en: Duplicate group

source: Дубликаты:
en: Duplicates:

source: Поиск дубликатов и противоречий
en: Searching for duplicates and inconsistencies

source: Выявление дубликатов и противоречий
en: Detection of duplicates and inconsistencies

source: Выбросы:
en: Outliers:

source: Столбец "%s" отсутствует во входной таблице №%d
en: No "%s" column in input table #%d

source: Запрещена замена заданным значением в упорядоченном наборе данных для колонки "%s" с непрерывным видом данных
en: Replacement with set value is prohibited in the ordered dataset for "%s" column with continuous data kind

source: Редактирование выбросов
en: Eliminate Outliers

source: Редактирование выбросов и экстремальных значений
en: Eliminate outliers and extremes

source: Вероятность принадлежности
en: Ownership probability

source: ЕМ Кластериз.:
en: EM Clustering:

source: EM Кластеризация
en: EM Clustering

source: Кластеризация данных алгоритмом EM
en: EM algorithm data clustering

source: Дополнение
en: Enrich

source: Связь должна содержать поле из главной таблицы
en: Link must contain a field from the main table

source: Индексирование присоединяемой таблицы %d
en: Indexing joined table %d

source: Построение результирующего набора
en: Building result dataset

source: Ошибка выполнения 1С ComConnector.Connect
en: Error executing 1C ComConnector.Connect

source: Дополнение данных
en: Enrich Data

source: Дополнение данных по справочникам
en: Enrich data using guides

source: Невозможно выделить имя исполняемого файла.
en: Failed to determine executable file name.

source: Командная строка пустая.
en: Empty command line.

source: Выполнение узла запрещено параметрами безопасности
en: Node execution forbidden by security settings

source: Результирующая командная строка пустая.
en: Empty result command line.

source: Программа
en: Program

source: Результат выполнения
en: Execution result

source: Выполнение внешней программы
en: External program execution

source: Выполнение компонента %s не разрешено
en: Execution of %s component is not allowed

source: Нельзя задать ссылку на компонент "%s", для которого невозможно наследование
en: Failed to set reference to "%s" component for which inheritance is not possible

source: Неисправен исходный компонент "%s" GUID=%s
en: "%s" GUID=%s source component is malfunctioning

source: Не доступен исходный компонент "%s" GUID=%s
en: "%s" GUID=%s source component not available

source: Не найден исходный компонент GUID=%s
en: GUID=%s source component not found

source: Не задан исходный компонент
en: Source component not set

source: Не удалось создать экземпляр класса %s, нет ответа после HTTP запроса
en: Failed to create %s class instance, no response after HTTP request

source: Не удалось загрузить конфигурацию внутреннего компонента
en: Failed to load the internal component configuration

source: %s (выполнение)
en: %s (execution)

source: Применение модели к новым данным
en: Apply model to new data

source: Ошибка разбора XML из строки %d входного набора. Код ошибки: %d. Сообщение: %s
en: Error parsing XML from row %d of the input dataset. Error code: %d. Message: %s

source: Ошибка инициализации Разбора XML: %s
en: XML parsing initialization error: %s

source: Запись в поток HTTP-ответа запрещена
en: Writing to HTTP response stream disallowed

source: Необходимо задать поле, содержащее XML
en: It is required to specify XML containing field

source: Не подключен входной источник данных
en: No input data source connected

source: Ошибки и коды завершения
en: Errors and exit codes

source: Фактический размер принятых данных %d не совпадает со значением заголовка Content-Length %d
en: Actual received data size %d inconsistent with Content-Length %d header value

source: Разбор XML: %s
en: XML Parsing: %s

source: Разбирает строковое поле набора данных как XML и импортирует его в выходной набор в соответствии с заданной схемой
en: Parses the string field of the dataset as XML and imports it to the output dataset according to the specified schema

source: Плохо обусловленная матрица факторного отображения
en: Ill-conditioned factor mapping matrix

source: Ошибочный размер матрицы факторного отображения
en: Invalid factor mapping matrix size

source: Входные данные не соответствуют обученной ранее модели
en: Input data does not match previously trained model

source: Размер предоставленного буфера %d недостаточен для чтения %d байт
en: The provided buffer size %d is too small to read %d bytes

source: Фактор. анализ:
en: Factor Analysis:

source: Фактор
en: Factor

source: Расчет факторов
en: Calculating factors

source: Факторы
en: Factors

source: Факторные нагрузки
en: Factor loadings

source: Факторный анализ
en: Factor Analysis

source: Определение значимых факторов
en: Identification of significant factors

source: %s и %s
en: %s and %s

source: Не удалось создать экземпляр класса %s, необходима поддержка ответом HTTP-клиента интерфейса IHTTPResponseEx
en: Failed to create %s class instance, HTTP client response must support IHTTPResponseEx interface

source: Сравниваемое значение не определено
en: The comparison value is null

source: Не удалось определить временной промежуток
en: Failed to define time span

source: Использование даты из набора данных для определении интервала времени не поддерживается
en: Use date from dataset is not supported to define time span

source: Не указан список значений
en: No list of values specified

source: Введенное значение нижней границы "%s" не соответствует типу фильтруемого столбца
en: Value "%s" entered as the lower bound doesn't match the filtered column's type

source: Введенное значение верхней границы "%s" не соответствует типу фильтруемого столбца
en: Value "%s" entered as the upper bound doesn't match the filtered column's type

source: Введенное значение "%s" не соответствует типу фильтруемого столбца
en: The entered value "%s" doesn't match the filtered column's type

source: Значение списка "%s" не соответствует типу фильтруемого столбца
en: The list value "%s" doesn't match the filtered column's type

source: Тип отношения не соответствует типу фильтруемого столбца
en: Relation type does not match the filtered column type

source: Нет ни одного условия фильтрации
en: No filtering criteria

source: Использование нумераторов строк не поддерживается
en: Row numerators not supported

source: Не указан тип данных
en: No data type specified

source: Привязка переменной к списку значений возможна только для целого и строкового типа фильтруемого столбца
en: Binding variable to value list is only possible for integer and string type of filtered column

source: Не удалось применить фильтр, вход не активирован
en: Failed to apply filter, input not activated

source: Выполнение фильтрации
en: Filtering data

source: Предварительный просмотр фильтрации
en: Previewing filtered data

source: Соответствуют условию
en: Filtered

source: Не соответствуют условию
en: Filtered Out

source: Достигнуто максимальное количество строк сканирования: %d
en: Maximum scanned row count reached: %d

source: Выбор строк по условию
en: Row filtering by criteria

source: В процедуру %s переданы некорректные данные
en: Incorrect data passed to %s procedure

source: Данных ряда недостаточно для обучения модели заданной структуры
en: Not enough data points in the series to train the model with the given structure

source: Обучение модели
en: Training the model

source: Вычисление прогноза
en: Calculating forecast

source: Длина вектора параметров %d не совпадает с требуемой %d
en: Vector lengh of %d parameters does not match the required %d

source: Текущая модель не включает константу
en: The current model has no intercept

source: Модель содержит нерассчитанные коэффициенты
en: Model contains unknown coefficients

source: Сезонная AR[%d]
en: Seasonal AR[%d]

source: Сезонная MA[%d]
en: Seasonal MA[%d]

source: Истекло время выполнения запроса
en: Request timed out

source: Доверительный интервал
en: Confidence interval

source: Порядок интегрированности
en: Integration order

source: Порядок сезонной интегрированности
en: Seasonal integration order

source: Не задан ни один структурный элемент модели
en: No structural model element specified

source: Запрос к URL "%s" завершился с ошибкой
en: Request to "%s" URL failed

source: Обучение модели %s
en: Training the model %s

source: Внутренняя ошибка: контекст не является контекстом обучения модели ARIMAX
en: Internal error: context is not the training context for ARIMAX model

source: ARIMAX: AIC текущей выбранной модели %s: %.8f
en: ARIMAX: AIC of the current selected %s model: %.8f

source: ARIMAX: AIC модели %s: %.8f
en: ARIMAX: AIC of %s model: %.8f

source: ARIMAX: Выбрана модель %s, Число степеней свободы: %d
en: ARIMAX: %s model selected, number of degrees of freedom: %d

source: Модель не может быть построена на указанных данных
en: The model cannot be trained on the basis of the specified data

source: Узел #%d присутствует в конфигурации повторно
en: Node #%d is duplicate in the configuration

source: Родительский узел #%d не найден в конфигурации
en: Parent node #%d not found in configuration

source: Попытка установить состояние "обучено" без указания выбранной модели
en: Attempt to set the "trained" status not specifying the selected model

source: Ошибка при выполнении HTTP запроса. Status code %d: %s
en: Failed to make HTTP request. Status code %d: %s

source: Коэффициент
en: Coefficient

source: Ошибка при выполнении HTTP запроса. TCP/IP Socket error %d: %s
en: Failed to make HTTP request. TCP/IP Socket error %d: %s

source: Имя входного поля
en: Input field name

source: Уникальное значение
en: Unique value

source: Недопустимые настройки модели: отсутствуют подбираемые параметры
en: Invalid model settings: no matched parameters

source: Модель %s допускает наличие только одного выходного поля
en: %s model allows only one output field

source: Не задано поле выходных данных
en: No output data field specified

source: Модель не обучена
en: Model not trained

source: Недопустимые свойства входного поля %s, вид данных %s, тип данных %s
en: Invalid %s input field properties, %s data kind, %s data type

source: Коэффициенты модели
en: Model coefficients

source: Превышено максимальное число переадресаций на: %s
en: Maximum redirect reached at: %s

source: Выход модели
en: Model output

source: %s|Нижняя граница
en: %s|Lower bound

source: Число степеней свободы остатков
en: Residual degrees of freedom

source: Случайный доступ к данным потока невозможен
en: Random access to stream data is not possible

source: %s|Ошибка аппроксимации
en: %s|Approximation error

source: T-статистика
en: T-statistic

source: %s|Верхняя граница
en: %s|Upper bound

source: Прогнозирование временных рядов с помощью модели ARIMA с возможностью включения внешних факторов (ARIMAX)
en: Time series forecast using ARIMA Model able to include exogenous factors (ARIMAX)

source: Размер данных потока не определен
en: Data stream size not defined

source: Необходимо указать хотя бы один вариант агрегации для факта "%s"
en: At least one aggregation option for "%s" fact must be specified

source: по
en: by

source: Сортировка результата
en: Sorting grouped data

source: Выполнение JavaScript-кода
en: JavaScript code execution

source: Аргумент [%d] имеет неверный тип
en: Invalid type of argument [%d]

source: Некорректное описание столбца
en: Invalid column definition

source: Не зарегистрирована реализация списка сертификатов
en: Certificate list implementation not registered

source: Метод вызван на некорректном объекте
en: Method called for invalid object

source: Объект не связан со столбцом
en: Object not associated with column

source: Сопоставление индексов
en: Mapping indexes

source: Формирование выходного набора
en: Generating output dataset

source: Полное
en: Full

source: Индексирование присоединяемой таблицы
en: Indexing joined table

source: Другие пользователи
en: Other People

source: Системная ошибка при создании GUID
en: System error while creating GUID

source: Поле
en: Field

source: Оператор
en: Operator

source: Добавить оператор ИЛИ ниже
en: Add OR operator after

source: Добавить оператор ИЛИ выше
en: Add OR operator before

source: Состояние входа
en: Input status

source: Предпросмотр
en: Preview

source: Выбрать все
en: Check all

source: Копировать выбранные
en: Copy selected

source: Добавить к выбранным
en: Add to selected

source: Инвертировать выбор
en: Invert selection

source: Отменить выбор всех
en: Uncheck all

source: Структура модели ARIMAX
en: ARIMAX Model Structure

source: Прогнозирование временных рядов
en: Time Series Prediction
